## Import Modules :
modul yang kita import kali ini cuma 1 :

1. pandas

In [1]:
import pandas as pd

- Setelah itu sebaiknya kita mengecek terlebih dahulu versi pandas yang kita gunakan saat ini, bertujuan agar apabila terjadi perbedaan output atau tampilan itu kemungkinan besar di sebabkan oleh perbedaan versi yang di gunakan.

In [2]:
print(pd.__version__ )

1.1.3

## Persiapan Data Frame

- mempersiapkan dictionary yang  terdiri dari kolom1 dan kolom2

- dengan memanggil pd.DataFrame

In [3]:
d = {'kolom_satu': [1, 2, 3, 4, 5],
     'kolom dua':[10, 20, 30, 40, 50]}
df = pd.DataFrame(d)
df

   kolom_satu  kolom dua
0           1         10
1           2         20
2           3         30
3           4         40
4           5         50

## Seleksi baris dengan query()

- dengan memanggil df.query

- harus di tuliskan dalam bentuk String

In [13]:
df.query('kolom_satu > 2')

   kolom_satu  kolom dua
2           3         30
3           4         40
4           5         50

In [15]:
df.query('`kolom dua` > 30')

   kolom_satu  kolom dua
3           4         40
4           5         50